---
title: WallFoundation
classe: Autodesk.Revit.DB.WallFoundation
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.HostObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# WallFoundation

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId WallId { get; }` | `wallFoundation.WallId` | ElementId |
| `WallFoundation Create(Document, ElementId, ElementId)` | `WallFoundation.Create(document, typeId, wallId)` | WallFoundation |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```